export default <any> {
    car: {
        damage: 'hp',
        text: 'По дорозі додому ваш працівник, який займає посаду "_", потрапив у ДТП. Переходячи дорогу у встановленому місці на працівника був скоєний наїзд через порушення водієм ПДД. Працівник отримав черепно-мозкову травму та численні синці, садна',
        variants: ['пігулки','сон','гарячі ванни','вітаміни'],
        treatment: 'сон'
    },
    electricity: {
        damage: 'hp',
        text: 'Під час робочого процесу ваш працівник, який займає посаду \'_\', отримав тілесні ушкодження, спричинені ураженням електричним струмом. Причиною виявилася несправність дротів, які були підключені до робочого комп\'ютера',
        variants: ['пігулки','сон','гарячі ванни','вітаміни'],
        treatment: 'гарячі ванни'
    },
    hotWater: {
        damage: 'hp',
        text: 'Під час обідньої перерви ваш працівник, який займає посаду "_", випадково пролив на себе окріп, що спричинило опіки на уражених ділянках.',
        variants: ['пігулки','сон','гарячі ванни','вітаміни'],
        treatment: 'вітаміни'
    },
    nervous: {
        damage: 'hp',
        text: 'Через проблеми в сім\'ї, недостатню заробітну плату та погану погоду ваш робітник, який займає посаду "_", отримав нервовий зрив. Через це працівник зовсім не може зосередитися на даних йому завданнях, що сильно знижує ефективність роботи',
        variants: ['пігулки','сон','гарячі ванни','вітаміни'],
        treatment: 'вітаміни'
    },
    crane: {
        damage: 'hp',
        text: '_ строительний кран',
        variants: ['пігулки','сон','гарячі ванни','вітаміни'],
        treatment: 'сон'
    },
    shawermaIntoxication: {
        damage: 'hp',
        text: '_ отравление шаурмой',
        variants: ['пігулки','сон','гарячі ванни','вітаміни'],
        treatment: 'пігулки'
    },
    steamBurn: {
        damage: 'hp',
        text: '_ опік парою',
        variants: ['пігулки','сон','гарячі ванни','вітаміни'],
        treatment: 'пігулки'
    }
}